

class AppStrings {
  static const String eventIntroduction = 'استعدوا لأكثر من مجرد حفل موسيقي! في 15 أغسطس، سيقدم دي جي خالد عرضاً لا يُصدق، مصحوباً بأضواء مبهرة وفعاليات خاصة. ستكون الليلة مليئة بالمفاجآت، وستترك في ذاكرتك ذكريات لا تُنسى';
  static const String expansionTicketInfo ='نص عربي تجريبي يستخدم لملء الفراغات في التصميمات والطباعة، حيث يمكن استخدامه كبديل مؤقت للنصوص الحقيقية. الهدف من هذا النص هو إعطاء المصمم أو المطور فكرة عن كيفية ظهور المحتوى في الشكل النهائي، دون الحاجة إلى استخدام نصوص ذات معنى أو محتوى فعلي. يُستخدم هذا النوع من النصوص بشكل واسع في العروض التقديمية والنماذج الأولية لإبراز العناصر البصرية والتركيز على التصميم بدلاً من المحتوى.';
  static const String paymentError = 'حدث خطأ أثناء محاولة إتمام عملية الدفع الخاصة بك.تأكد من صحة تفاصيل البطاقة التي تم إدخالها.تأكد من وجود رصيد كافٍ في الحساب.جرب استخدام طريقة دفع أخرى.إذا استمرت المشكلة، يُرجى الاتصال بنا على [رقم خدمة العملاء] أو مراسلتنا عبر البريد الإلكتروني على [البريد الإلكتروني لخدمة العملاء]، وسنكون سعداء بمساعدتك في حل المشكلة.';
}
